In [5]:

#import pandas for well maintained data...data manipulation
n=int(input("enter the no of users="))

b=open("record1.csv",'w')
b.write("Name,Age,Address,Phone\n")
for i in range(n):

    name=input("enter the name=")
    age=int(input("enter the age="))
    address=input("enter the address=")
    phone_number=int(input("enter the phone number="))
    info=f"{name},{age},{address},{phone_number}\n"  #or info =f"
    
   
   
    b.write(info)
    
b.close()

enter the no of users=2
enter the name=sdfsdf
enter the age=23
enter the address=dfsdf
enter the phone number=2424234
enter the name=dfsdfsdf
enter the age=23
enter the address=dfsdfsd
enter the phone number=234324

In [8]:
import pandas as pd
df=pd.read_csv('record1.csv',nrows=2) #nrows shows the number of data..comma separated value is diff value
df

       Name  Age  Address    Phone
0    sdfsdf   23    dfsdf  2424234
1  dfsdfsdf   23  dfsdfsd   234324

In [9]:
df.head() #mathibata data

       Name  Age  Address    Phone
0    sdfsdf   23    dfsdf  2424234
1  dfsdfsdf   23  dfsdfsd   234324

In [10]:
df.tail()

       Name  Age  Address    Phone
0    sdfsdf   23    dfsdf  2424234
1  dfsdfsdf   23  dfsdfsd   234324

In [11]:
df['Name']

0      sdfsdf
1    dfsdfsdf
Name: Name, dtype: object

In [13]:
import pandas as pd
df=pd.read_csv('record1.csv',index_col='Phone') #index_col gives unique and universal  
df

             Name  Age  Address
Phone
2424234    sdfsdf   23    dfsdf
234324   dfsdfsdf   23  dfsdfsd

In [14]:
import pandas as pd
df=pd.read_csv('record1.csv',index_col=0) #0 index ma name cha

In [15]:
df

          Age  Address    Phone
Name
sdfsdf     23    dfsdf  2424234
dfsdfsdf   23  dfsdfsd   234324

In [16]:
#usecols..means which column to use.

import pandas as pd
df=pd.read_csv('record1.csv',index_col='Phone', usecols=(['Phone','Name']))

In [17]:
df

             Name
Phone
2424234    sdfsdf
234324   dfsdfsdf

In [20]:
#bich bata data nikalna...iloc
#df.iloc[0:3,0:2] 0 to 3 is row...0 to 2 is column..ie.name and ag ein this case

import pandas as pd
df=pd.read_csv('record1.csv',index_col='Phone') 
df.iloc[0:1,0:2]

           Name  Age
Phone
2424234  sdfsdf   23

In [21]:
import pandas as pd
df=pd.read_csv('record1.csv') 
df.iloc[0:1,0:2]

     Name  Age
0  sdfsdf   23

In [32]:
#queryy

df[df['Name']=='dfsdfsdf']

       Name  Age  Address   Phone
1  dfsdfsdf   23  dfsdfsd  234324

       Name  Age  Address    Phone
0    sdfsdf   23    dfsdf  2424234
1  dfsdfsdf   23  dfsdfsd   234324

In [34]:
df[(df['Age']==23)|(df['Address']=='dfsdf')]

       Name  Age  Address    Phone
0    sdfsdf   23    dfsdf  2424234
1  dfsdfsdf   23  dfsdfsd   234324

In [35]:
df[(df['Age']==23) & (df['Address']=='dfsdf')] # & is for and

     Name  Age Address    Phone
0  sdfsdf   23   dfsdf  2424234

In [38]:
#Dataframe..list inside dictionary can make it easy
#in dataframe if we embed dictionary it becomes dataframe

import pandas as pd

data1={'Names':['Ram','Shyam','Hari'],'Address':['kapan','Bhaktapur','Kathmandu'],'Age':[23,44,35]}

data2={'Names':['Sita','Sabita','Hina'],'Address':['kapan1','Bhaktapur2','Kathmandu3'],'Age':[13,34,25]}

df1=pd.DataFrame(data1)

df2=pd.DataFrame(data1)

df=pd.concat([df1,df2])

df.to_csv('record1.csv',)#df.to_csv()('books.csv') le concat gareko kura lai ie obtained df lai books.csv ma lagera rakhcha
df #df.head le 5 ota matra display garcha

   Names    Address  Age
0    Ram      kapan   23
1  Shyam  Bhaktapur   44
2   Hari  Kathmandu   35
0    Ram      kapan   23
1  Shyam  Bhaktapur   44
2   Hari  Kathmandu   35

In [2]:

#import pandas for well maintained data...data manipulation
n=int(input("enter the no of users="))

b=open("record2.csv",'w')
b.write("Name,Age,Address,Phone\n")
for i in range(n):

    name=input("enter the name=")
    age=int(input("enter the age="))
    address=input("enter the address=")
    phone_number=int(input("enter the phone number="))
    info=f"{name},{age},{address},{phone_number}\n"  #or info =f"
    
   
   
    b.write(info)
    
b.close()

enter the no of users=5
enter the name=sita
enter the age=12
enter the address=kapan
enter the phone number=9876453266
enter the name=sita
enter the age=22
enter the address=lalitpur
enter the phone number=9845362788
enter the name=gita
enter the age=34
enter the address=bhaktapur
enter the phone number=9841234355
enter the name=rita
enter the age=11
enter the address=kalopul
enter the phone number=9851245233
enter the name=shyam
enter the age=33
enter the address=terai
enter the phone number=9851246256

In [3]:
import pandas as pd
df=pd.read_csv('record2.csv',index_col='Name')
df

       Age    Address       Phone
Name
sita    12      kapan  9876453266
sita    22   lalitpur  9845362788
gita    34  bhaktapur  9841234355
rita    11    kalopul  9851245233
shyam   33      terai  9851246256

In [4]:
#axis 0 is for deleting rows elements and 1 is for deleting whole column element
import pandas as pd
df=pd.read_csv('record2.csv',index_col='Name')
df.drop(['Age'],axis=1)

         Address       Phone
Name
sita       kapan  9876453266
sita    lalitpur  9845362788
gita   bhaktapur  9841234355
rita     kalopul  9851245233
shyam      terai  9851246256

In [5]:
import pandas as pd
df=pd.read_csv('record2.csv',index_col='Name')
df.drop(['rita'],axis=0)

       Age    Address       Phone
Name
sita    12      kapan  9876453266
sita    22   lalitpur  9845362788
gita    34  bhaktapur  9841234355
shyam   33      terai  9851246256

In [6]:
import csv
fields=['hari','26','kathmandu','9864532511']
with open('record2.csv','a') as f:  #f is an object
    w=csv.writer(f) #writer and writerow is a predefined function
    w.writerow(fields) #record2 ma value aucha..
    #vertically value is done through dataframe and horizontally can be done in this way